{
  "videos" : {
    "Joan Stone" : {
      "bioCopy" : "Interim Dean of CIAS,1997 established the original committee to develop a new BFA curriculum which drew on CIAS strengths and spoke to the 1995 Strategic Plan goal of a seamless university. New Media Design, part of the interdisciplinary New Media program, one of many successful initiatives spearheaded by Dr. Stone, appointed Dean in 1999 and served until 2009.",
      "interviewee" : "Joan Stone",
      "videoUrl" : "assets/videos/1.mp4"
    },
    "Frank Cost" : {
      "bioCopy" : "Professor in the School of Graphic Arts and Printing and Assistant Desn in 1997, supported a publishing and business component of New Media. Today, Program Chair of Photographic Arts & Sciences",
      "interviewee" : "Frank Cost",
      "videoUrl" : "assets/videos/2.mp4"
    },
    "Steve Jacobs" : {
      "bioCopy" : "Professor, Information Technology, Presently, Professor, Associate Director of the MAGIC Center",
      "interviewee" : "Steve Jacobs",
      "videoUrl" : "assets/videos/3.mp4"
    },
    "Robert Keough" : {
      "bioCopy" : "Professor: 1997 Computer Graphics Design Faculty member. Taught Computer Graphics 22 years. Retired in 2005.",
      "interviewee" : "Robert Keough",
      "videoUrl" : "assets/videos/4.mp4"
    },
    "Steve Kurtz" : {
      "bioCopy" : "Professor Information Technology. Presently Professor. in the School of Interactive Games and Media, B. Thomas Golisano College of Computing and Information Sciences",
      "interviewee" : "Steve Kurtz",
      "videoUrl" : "assets/videos/5.mp4"
    },
    "Edith Lawson" : {
      "bioCopy" : "served as IT department chair for eight years In 2005 appointed associate dean of the B. Thomas Golisano College of Computing and Information Sciences",
      "interviewee" : "Edith Lawson",
      "videoUrl" : "assets/videos/6.mp4"
    },
    "Marianne O’Loughlin" : {
      "bioCopy" : "Associate Professor: 1997 Computer Graphics Design Faculty member. Program Chair New Media Design 1999-2009. Now teaching full-time in the New Media Design program.",
      "interviewee" : "Marianne O’Loughlin",
      "videoUrl" : "assets/videos/7.mp4"
    },
    "Malcolm Spaull" : {
      "bioCopy" : "Professor: 1997 Director of the Center for Digital Media, argued for Film and Animation involvement and taught the Digital Video classes in the initial years. Presently, Prof. Spaull is Administrative Chair of Film & Animation.",
      "interviewee" : "Malcolm Spaull",
      "videoUrl" : "assets/videos/8.mp4"
    },
    "James VerHague" : {
      "bioCopy" : "Professor: 1997 Computer Graphics Design Faculty member. Presently, Professor Emeritus.",
      "interviewee" : "James VerHague",
      "videoUrl" : "assets/videos/9.mp4"
    },
    "Nancy Ciolek" : {
      "bioCopy" : "Associate Professor: 1997 Computer Graphics Design Faculty member. 1999, Administrative chair, School of Design. Presently Graphic Design program chair.",
      "interviewee" : "Nancy Ciolek",
      "videoUrl" : "assets/videos/10.mp4"
    },
    "Jason Arena" : {
      "bioCopy" : "Associate professor of New Media Design at RIT since 2001.",
      "interviewee" : "Jason Arena",
      "videoUrl" : "assets/videos/11.mp4"
    },
    "Therese Hannigan" : {
      "bioCopy" : "Associate professor, New Media Design at RIT since 2000.",
      "interviewee" : "Therese Hannigan",
      "videoUrl" : "assets/videos/12.mp4"
    },
    "Adam Smith," : {
      "bioCopy" : "Associate Professor and Program Chair of the New Media Design program",
      "interviewee" : "Adam Smith",
      "videoUrl" : "assets/videos/13.mp4"
    }
  }
}
