[
  {
    "date": "2015-10-13T06:48:23+00:00",
    "title": "We can do better",
    "content": "<h2>On Conference Accountability and Representation of Diversity</h2>\n<p>RIT has an annual design conference called &#8220;Thought at Work,&#8221; that according to the <a href=\"http://thoughtatwork.org\" target=\"_blank\">website</a>, is &#8220;a 3-day design conference for students, by students. It bridges the gap between the academic and professional worlds by providing a platform to collaborate, learn and hang out.&#8221;</p>\n<p>I wrote a letter to address some diversity concerns and sent it out. Hopefully it is being delivered to the appropriate recipients. I am also posting it here to promote awareness of these issues for others in our industry.</p>\n<p>&nbsp;</p>\n<hr />\n<p>&nbsp;</p>\n<p class=\"p1\"><span class=\"s1\">To Whom it May Concern:</span></p>\n<p class=\"p1\"><span class=\"s1\">I’m writing this letter to address some concerns I and others have with the way that RIT’s student run conference “Thought At Work” is being run. According to the event <a href=\"http://thoughtatwork.org\" target=\"_blank\">website</a>, the conference is a “design conference for students, by students. It bridges the gap between the academic and professional worlds by providing a platform to collaborate, learn and hang out.”</span></p>\n<p class=\"p1\"><span class=\"s1\">Thought At Work recently posted their speaker list for the conference for the 2015 event on their website, <a href=\"http://thoughtatwork.org\" target=\"_blank\"><span class=\"s2\">thoughtatwork.org</span></a>. I excitedly opened it up, to see that there are currently 13 speakers listed and only one of them is a woman. I brought these concerns up to a member of the Thought At Work team and I was told that “all of the women we asked said they were busy.” I assert that if they were able to find 12 men, there is no reason that they could not have found a proportionate amount of women. They clearly weren’t asking enough.</span></p>\n<p class=\"p1\"><span class=\"s1\">Some of the greatest pioneers of our industry were and are women, but we still have issues getting women and keeping women in our field. A much-quoted survey of the UK design industry published by the Design Council in 2010 revealed that only 40% of designers were women, in startling contrast to the 70% of female design students. I’d assert that RIT wishes for all of their students to enter and be successful within the industry of their chosen major. In addition, CIAS is already suffering from low female enrollment, with the last reported statistic being a total of 21.6% of the school being female. We can do better.</span></p>\n<p class=\"p1\"><span class=\"s1\">We are showing our students an incomplete and limited perspective on our industry. We are releasing students into an amazing industry that values talent and passion and hard work above all, and I want to be able to show that in our school. There is so much more to our industry than what we are showing our students with this line-up. Students need role models that they can relate to, and that is what this conference is supposed to be about.</span></p>\n<p class=\"p1\"><span class=\"s1\">Here is what I ask of RIT and the Thought At Work team: First of all, introduce a clear Code of Conduct that applies to staff, volunteers, speakers, and attendees of the conference. Post it publicly throughout social media channels and on the TAW website. You can adapt an open source one like this one here: <a href=\"http://confcodeofconduct.com/\" target=\"_blank\">http://confcodeofconduct.com/</a> In fact, many women, such as the talented animator Rachel Nabors, refuse to speak at conferences that do not have a Code of Conduct. Creating a CoC is very easy and does a lot of good.</span></p>\n<p class=\"p1\"><span class=\"s1\">Secondly, make a public commitment to showing diverse representation of ethnicity and gender in our industry by committing to having at least 40% speakers be female and/or ethnically diverse for the 2016 conference and future events. Post this on the website and make it public information, and make it a priority early on in the decision process. Reach out to people in the industry, don’t just bring in people you know. There are more talented people out there than just the ones we personally know or are local to Rochester.</span></p>\n<p class=\"p1\"><span class=\"s1\">I sincerely hope that RIT and Thought at Work be able to take accountability for this situation and work to remedy it for the future. We can be better. Let’s make it happen.</span></p>\n<p class=\"p3\"><span class=\"s1\">Sincerely yours,</span></p>\n<p class=\"p3\"><span class=\"s1\">A Concerned Student</span></p>\n<p class=\"p1\"><span class=\"s1\">Sources:</span></p>\n<p class=\"p1\"><span class=\"s2\"><a href=\"http://www.itsnicethat.com/articles/rebecca-wright\">http://www.itsnicethat.com/articles/rebecca-wright</a></span></p>\n<p class=\"p1\"><a href=\"https://goo.gl/ItUj2i\">https://goo.gl/ItUj2i</a></p>\n<p class=\"p1\"><span class=\"s2\"><a href=\"http://rachelnabors.com/2015/09/01/code-of-conduct/\">http://rachelnabors.com/2015/09/01/code-of-conduct/</a></span></p>\n<p class=\"p1\"><span class=\"s2\"><a href=\"http://confcodeofconduct.com/\">http://confcodeofconduct.com/</a></span></p>\n",
    "excerpt": "<p>On Conference Accountability and Representation of Diversity RIT has an annual design conference ca &#8230;</p>\n",
    "slug": "we-can-do-better"
  },
  {
    "date": "2015-09-01T00:34:48+00:00",
    "title": "My Top Companies",
    "content": "<h2>My Top 20 Companies</h2>\n<p>Hello! It&#8217;s been awhile since I&#8217;ve blogged. I&#8217;ve just started my last semester at RIT so things are crazy. Big news though: Come January, <strong>I will be starting my first full-time job as a Web Developer at LinkedIn!</strong> Yay!</p>\n<p>One of my classes this semester is called New Media Design Career Skills. Recently we had to do an exercise for homework where we identify 20 companies where we would like to work, and describe why for 10 of them. I&#8217;ve decided to post this on my blog as well as submit it, as it was a good thought exercise. So without further delay&#8230;</p>\n<ol>\n<li>LinkedIn (of course)</li>\n<li>Etsy</li>\n<li>Facebook</li>\n<li>Stripe</li>\n<li>Netflix</li>\n<li>Adobe</li>\n<li>Box</li>\n<li>GoodReads</li>\n<li>Eventbrite</li>\n<li>Flipboard</li>\n<li>Airbnb</li>\n<li>OpenTable</li>\n<li>Nest</li>\n<li>Google Creative Labs</li>\n<li>Weebly</li>\n<li>Spotify</li>\n<li>CodePen</li>\n<li>Team Treehouse</li>\n<li>Atlassian</li>\n<li>Trello</li>\n</ol>\n<hr />\n<p>&nbsp;</p>\n<h2>My Top 10 &amp; why I chose them</h2>\n<h3>LinkedIn</h3>\n<p>I chose to go to LinkedIn for a lot of reasons. First, they have a really friendly culture for people with my skillset (web developer, mostly front end). A lot of Silicon Valley companies group web people in generic “software engineer” labels, and they are expected to have CS degrees and do algorithm code interviews that are irrelevant in a web developer’s daily work. LinkedIn keeps their web people in a different organization that has the freedom to conduct interviews differently. It was a better experience that tested me on things I have a background in. In addition, I appreciate the transparency I was given in the interview and offer process. I expect the same sort of transparency within the company.</p>\n<h3>Etsy</h3>\n<p>I love Etsy’s product, as a seller, buyer, and developer. I think they do a great job. Also, I first met people from Etsy at a hiring event for women, where they presented on how they create a friendly workplace culture for women. In addition I read a great article about how a disagreement was resolved there that painted an image of an awesome work culture. Although they’re suffering a bit post-IPO, I feel confident they’ll bounce back.</p>\n<h3>Facebook</h3>\n<p>Although Facebook’s public reputation is a bit not so good, their workplace culture has a great rep. Everyone I’ve met from there says they love it, though it’s hard work. They’re also making huge strides for web application development with tools like Flow and React and Nuclide.</p>\n<h3>Stripe</h3>\n<p>Apart from being an awesome Y-Combinator success story, Stripe employs an alternative interview process that is a really great attempt to break the toxic SV interview culture. They focus on candidate comfort and even let you use your own computer. <a href=\"http://www.quora.com/What-is-the-engineering-interview-process-like-at-Stripe\">http://www.quora.com/What-is-the-engineering-interview-process-like-at-Stripe</a></p>\n<h3>Netflix</h3>\n<p>Netflix only hires senior-level employees, and they’ve managed to cultivate a successful culture full of really smart high-impact people. Their UI engineers in particular do some really innovative work, and they’re great at pushing the web standards and being forward thinkers with regards to new technology.</p>\n<h3>Adobe</h3>\n<p>I experienced a bit of culture at Adobe while I was there, and I think it’s a really great company. They treat employees well, and they’re very ethical and stand by their core principles. I also like how they’ve become a sort of patron to artists and their office decorations  and swag always features individual artists’ work.</p>\n<h3>Box</h3>\n<p>I’ve heard good things about working there from people I know. I love how they saw an opportunity to be Dropbox for business, and went after it wholeheartedly, which in fact spurred development for the actual Dropbox for Business. In addition, they’ve managed to hire and keep amazing talent like Nicholas Zakas.</p>\n<h3>GoodReads</h3>\n<p>I love the GoodReads product though I think the UX could use some work, and I think they‘ve found and dominated their niche market. In addition, they’ve been acquired by Amazon, so that offers a bit more career mobility.</p>\n<h3>Eventbrite</h3>\n<p>I read a few articles on their great work culture and met some people from there at conferences that seemed awesome. Also when I was a candidate for an internship there, I received the coolest take home code test I’ve gotten to date, that had challenges like “build an interactive data viz using the Eventbrite API.” I had already accepted Adobe’s offer at this point, but I almost did it anyway for fun.</p>\n<h3>Flipboard</h3>\n<p>Flipboard is one of my few must-have mobile apps and I love the product. In addition, I really love the experimental innovations they’ve made with things like creating their whole web app in &lt;canvas&gt; as an experiment in web performance, and then blogging about it.</p>\n<p>&nbsp;</p>\n<p>Well there you have it! There are many many more, but this was definitely a good thought exercise.</p>\n",
    "excerpt": "<p>For NMD Careers Skills, we had to identify 20 companies where we would like to work, and describe wh &#8230;</p>\n",
    "slug": "my-top-companies"
  },
  {
    "date": "2015-06-22T22:53:53+00:00",
    "title": "Growth Hacking Talk @ Recurly",
    "content": "<h2>SF Design Week is Awesome!</h2>\n<p>A while ago, I attended a few more events that were really interesting. The first was a Growth Hacking talk from Recurly, which actually wasn&#8217;t a part of the SFDesignWeek events but still really interesting, and the second was a talk about Data Visualization from Salesforce.</p>\n<h3>Driving Company Growth Through Testing</h3>\n<p>I learned a lot at this talk, even though I probably wasn&#8217;t the target audience. I think it was probably more for the management type, but it was still really relevant to my interests. It was all about best practices when using testing to drive growth. Sean Ellis, current CEO of GrowthHackers.com and marketing leader of breakout companies including Dropbox and LogMeIn (IPO), was the main speaker for the talk. He did a presentation, and then it was followed by an interview from a Recurly exec, and then Q&amp;A with the audience.</p>\n<h3>The Process Cycle</h3>\n<p>Prior to developing a process, you need to identify your &#8220;must need&#8221; users &#8212; users that think your product is a must-have for the long-term. These are users that answer &#8220;very disappointed&#8221; when you ask them &#8220;How disappointed would you be if you could no longer use this product?&#8221; These are users that would convert to a premium model. Sean described a pretty clean process cycle for businesses to follow when testing:</p>\n<ol>\n<li>Unbridled Ideation\n<ul>\n<li>This is the stage where you spit out as many ideas as possible, viable or not. Sean suggested not relying on one person&#8217;s ideas,  ideating across all areas (like acquisition vs. revenue), and thanking contributors personally and providing incentive.</li>\n<li>Work through a constructive critique, and be transparent about why an idea may or may not work (takes too much time, etc)</li>\n</ul>\n</li>\n<li>Prioritize Backlog\n<ul>\n<li>This is where you formalize the ideas created in step 1 in an &#8220;Experiment Doc,&#8221; and include preliminary research, a hypothesis (every test should have one), and a target lever.</li>\n<li>The goal for every test is the highest impact with the least effort.</li>\n</ul>\n</li>\n<li>High Tempo Testing\n<ul>\n<li>Sean asserted that &#8220;tempo is everything&#8221; and suggests having weekly meetings and a test launch target. These weekly meetings should never include conversations that include &#8220;wouldn&#8217;t it cool if&#8230;?&#8221; because that just takes forever and nothing gets done. I loved this, actionable items are the goal at this stage.</li>\n<li>Constantly assess the process and try and fix bottlenecks that are preventing test tempo.</li>\n</ul>\n</li>\n<li>Build Knowledge Base\n<ul>\n<li>Every test leads to learning, and this needs to be documented. This ensures transparent access and sharing.</li>\n</ul>\n</li>\n</ol>\n<h3>Interesting Tidbits</h3>\n<p>There were a few things that Sean mentioned that stood out as pretty interesting to me.</p>\n<ul>\n<li>Many changes across pricing led to the conclusion that people aren&#8217;t very price sensitive. Decreasing price of his service didn&#8217;t increase demand, but in fact increasing it did.</li>\n<li>Sidekick at Hubspot runs 30 tests a week, which is crazy. I use and love this product as well.</li>\n<li>Moving the email signup form from the bottom of the page to the top caused a 700% increase in signups</li>\n<li>You can&#8217;t always be clear on cause and effect when running tests, you can measure like &#8220;I&#8217;m 80% sure than we had results because of the test we ran.&#8221; You also use predictive actions like &#8220;someone who comes back 10 times in the first week is more likely to come back in 10 months.&#8221;</li>\n<li>You can using a negative hypothesis at times, like turning off Adwords for a week.</li>\n<li>Embedded media (ex: modal video) adds more engagement time. This was relevant to a project I&#8217;m working on at my internship.</li>\n<li>Testing teams work best with 1 growth engineer, 1 growth designer, and 1 growth project manager.</li>\n</ul>\n<p>This was a super interesting event and I learned a lot that will be really useful in the future! Stay tuned for a recap of the Data Viz event at Saleforce.</p>\n",
    "excerpt": "<p>What I learned from Sean Ellis, current CEO of GrowthHackers.com and marketing leader of breakout co &#8230;</p>\n",
    "slug": "growth-hacking-talk-recurly"
  },
  {
    "date": "2015-06-10T18:19:39+00:00",
    "title": "Netflix Happy Hour &#038; SF Design Week",
    "content": "<h2>It&#8217;s SF Design Week!</h2>\n<p>Well. I guess it&#8217;s more like a couple of weeks actually.</p>\n<p>Anyway, I&#8217;m lucky enough to be spending the summer in the San Francisco Bay Area at Adobe. Adobe&#8217;s HQ is located in San Jose (south bay) and I&#8217;ve been living in Palo Alto. It&#8217;s nice because I can still get to the downtown SF pretty easily via the Caltrain from Palo Alto, and still get to San Jose for work easily as well. The whole area has a really huge &amp; friendly community for designers and developers.</p>\n<p>SF Design Week is a series of events around the area about design, entrepreneurship, and general awesomeness. I&#8217;ve signed up for a few of the events, including yesterday&#8217;s Happy Hour at Netflix HQ in Los Gatos. I met a few really cool people there, and I got to preview the new Netflix homepage that will be launching soon, as well as learn a bit about how Netflix&#8217;s designers work.</p>\n<p>Here&#8217;s the <a href=\"http://sfdesignweek.org\">SFDesignWeek website.</a> I&#8217;m also going to be attending Quora&#8217;s event about &#8220;Designing Social Systems&#8221; (I &lt;3 Quora, <a href=\"http://www.quora.com/Sarah-Federman\">follow me</a>) and Salesforce&#8217;s UXNight about Data Visualization later this week.</p>\n<h3>UX at Netflix</h3>\n<p>Although I didn&#8217;t really get to speak with many Netflix designers (the whole event was way less formal than I expected), I really enjoyed learning a bit about how they work. I&#8217;ve never worked on such a large scale application like Netflix, and it&#8217;s super interesting to learn about how they iterate on their UX. They are largely data driven, and focus a lot on beta testing changes. I believe we were told that on average we are each a part of at least 10 different beta tests, which can range from tiny changes like a different button or to large changes like an entirely new homepage. Newer users tend to get larger changes because it&#8217;s easier to present them with a new experience rather than switch older users. This way changes aren&#8217;t so jarring, and older users don&#8217;t have to see a large change that may not have worked switched back to what they saw before the beta test.</p>\n<h3>The Bay Community is Awesome</h3>\n<p>I also met a couple of people working at Facebook who were really awesome. Facebook keeps surprising me, their workplace culture has a great rep, and their open source contributions keep getting better. I only ever hear great things about working for them. I feel really good about companies with an &#8220;open&#8221; culture. I met a Product Designer from there at the event, and I was surprised (and delighted!) to learn that all designers at Facebook prototype their own work, primarily with FramerJS and Origami, and there is an expectation that you have some experience with coding. That&#8217;s really awesome, and great to hear especially from a big company that might have otherwise had a lot of people working as cogs in only one area (UX vs visual vs motion, etc).</p>\n<p>I met a few people who studied Human Factors, one from a consultancy in Cambridge that was visiting California and one from Facebook. I&#8217;d never really heard much about the field, and it was interesting to learn about how it overlaps with UX and how the principles apply to their work. It&#8217;s largely similar except that their focus much less on digital interfaces and more with physical hardware, though it&#8217;s constantly evolving. They also do a lot more quantitative research than we do in New Media Design. I really hope our classes get more detailed in quantitative research for our senior year, I think it&#8217;s extremely interesting.</p>\n<p>Tonight I&#8217;m off to UXNight from Salesforce to hear all about data which should be really awesome! I really love the bay.</p>\n",
    "excerpt": "<p>It&#8217;s SF Design Week! Well. I guess it&#8217;s more like a couple of weeks actually. Anyway, I&#038; &#8230;</p>\n",
    "slug": "netflix-happy-hour-sf-design-week"
  },
  {
    "date": "2015-06-04T17:28:26+00:00",
    "title": "I made front page of MaterialUp",
    "content": "<h3>I&#8217;m famous! Okay not really.</h3>\n<p>But I do have some upvotes! So today I woke up to a bunch of Twitter notifications from a tweet I&#8217;d been mentioned in. Turns out a design I posted last week on Dribbble has been featured on the front page of MaterialUp today! MaterialUp is a curated showcase of &#8220;the best of material design&#8221; that&#8217;s been around for about 6 months. I guess they used the Dribbble API to grab my project information, maybe they found it because it was tagged &#8220;material?&#8221; I don&#8217;t know, but I don&#8217;t mind. Here&#8217;s the feature: <a href=\"http://www.materialup.com/posts/rit-events-responsive-redesign\">http://www.materialup.com/posts/rit-events-responsive-redesign</a></p>\n<p>This was a smaller project I did last semester for my New Media Interactive III course with Adam Smith. We did a responsive redesign of the current RIT event calendar at <a href=\"https://events.rit.edu/\">https://events.rit.edu/</a> the post only showcases the desktop version, but we also did a tablet and a mobile version for the project.</p>\n",
    "excerpt": "<p>My event calendar design is currently being featured in a curated gallery!</p>\n",
    "slug": "i-made-front-page-of-materialup"
  },
  {
    "date": "2015-05-23T17:54:16+00:00",
    "title": "I&#8217;m a Senior Now!",
    "content": "<h3>At Long Last!</h3>\n<p>So it&#8217;s been a pretty crazy semester. I just turned in my last projects and now it&#8217;s time to pack up and head out to California and start my internship at Adobe. I&#8217;m going to be working in the Imagination Lab. My mentor is a Web Applications Engineer and I&#8217;m going to be redesigning and developing a new Adobe Research HTML newsletter, and designing, developing, and migrating to a new internal Adobe Research website. I&#8217;m really excited to get started!</p>\n<p>I&#8217;ve also signed up for Intern-a-palooza, and AngelHack Silicon Valley, which I&#8217;m sure will be fun and great places to meet people. I&#8217;m going to be living in Palo Alto and commuting to San Jose with my roommate who is also interning at Adobe. Our other roommate is a Google intern.</p>\n<p>My main summer side project is working on my WebGL interactive storybook application, and hopefully to mess around with some Arduino stuff. I also would like to get my portfolio responsive (because <a href=\"http://www.inc.com/john-boitnott/how-to-stop-google-s-mobilegeddon-from-harming-you.html\">MobileGeddon</a> of course).</p>\n<p>Heading out on tomorrow bright and early! Wish me luck!</p>\n",
    "excerpt": "<p>And off to California I go! Happy summer!</p>\n",
    "slug": "im-a-senior-now"
  },
  {
    "date": "2015-05-05T00:00:13+00:00",
    "title": "Aphrodite @ Imagine RIT",
    "content": "<p>Imagine RIT is an innovation + creativity festival run annually at Rochester Institute of Technology, and this year I helped present Aphrodite, a haskell-based web app built for WIC Hacks.</p>\n<p>Aphrodite helps women find verified clinics near them. I worked on the front end design, and Susan Lunn and Madison Flaherty created a Haskell backend. We&#8217;re currently working on getting access to the Planned Parenthood.</p>\n",
    "excerpt": "<p>Imagine RIT is an innovation + creativity festival run annually at Rochester Institute of Technology &#8230;</p>\n",
    "slug": "aphrodite-imagine-rit"
  },
  {
    "date": "2015-05-04T21:32:54+00:00",
    "title": "HFOSS Quiz 2",
    "content": "<p>In the first 3 Chapters of the SFLC&#8217;s <em>FOSS Legal Primer</em>, there was much background information on the types of licenses a FOSS Developer may choose, and why.</p>\n<ol>\n<li>When does a work become &#8220;copyrighted&#8221; by an Author?\n<ul>\n<li>As soon as it&#8217;s produced and put onto something tangible (file saved, written down, etc)</li>\n</ul>\n</li>\n<li>Without copyright, there could be no copyleft. What are the copyrights that an author has when they create a work, according to the US Copyright office?\n<ul>\n<li>Right to sell, reproduce, edit, distribute, and pass permission of any of these things to others.</li>\n</ul>\n</li>\n<li>Free/Open Source Licenses fall onto a <em>spectrum</em> of Software Freedom. What descriptive words are at either end?\n<ul>\n<li>Restrictive &amp; Distributive vs Permissive &amp; Non-Copyleft</li>\n</ul>\n</li>\n<li>When someone reliquishes their copyrights, this is referred to as what?\n<ul>\n<li>Copyright transfer</li>\n</ul>\n</li>\n</ol>\n<p>Below is a list of licenses. Please identify where on the spectrum each falls, and whether or not it is an OSI approved license.</p>\n<ul>\n<li>GPLv2\n<ul>\n<li>copyleft, OSI</li>\n</ul>\n</li>\n<li>BSD\n<ul>\n<li>non-copyleft, non-OSI</li>\n</ul>\n</li>\n<li>GPLv3\n<ul>\n<li>copyleft, OSI</li>\n</ul>\n</li>\n<li>MIT\n<ul>\n<li>non-copyleft, permissive, non-OSI</li>\n</ul>\n</li>\n<li>AGPLv3+\n<ul>\n<li>copyleft OSI</li>\n</ul>\n</li>\n<li>Apache 2.0\n<ul>\n<li>copyleft, OSI</li>\n</ul>\n</li>\n<li>LGPL\n<ul>\n<li>copyleft, OSI</li>\n</ul>\n</li>\n<li>WTFPL\n<ul>\n<li>permissive, non-OSI</li>\n</ul>\n</li>\n</ul>\n<p><strong>Bonus</strong>:</p>\n<p>True or False: You cannot sell GPL&#8217;d software <b>True</b></p>\n<p>True or False: You can fork a GPL licensed Project and release it under an MIT license? <b>False</b></p>\n<p>True or False: You can fork a MIT licensed Project and release it under an GPL license? <strong>True</strong></p>\n",
    "excerpt": "<p>In the first 3 Chapters of the SFLC&#8217;s FOSS Legal Primer, there was much background information &#8230;</p>\n",
    "slug": "hfoss-quiz-2"
  },
  {
    "date": "2015-04-25T19:52:32+00:00",
    "title": "FITC Toronto Day 3",
    "content": "<h2>FITC Toronto 2015</h2>\n<p>FITC is an annual design conference hosted in Toronto focused on merging the future, innovation, technology, and creativity! I was fortunate enough to win a free ticket for the second time when I entered the women’s initiative. I entered a site I designed and developed quickly for the contest.</p>\n<h3>Day 3</h3>\n<p>On day 3, we were finally totally prepared. We left on time and knew the way to the conference. We had lunch at a Crepe cafe, which was really awesome.</p>\n<h3>Favorite Talks</h3>\n<p>I really liked the talks about Arduino and Maker tech. I actually went and bought an Arduino starter kit so I could start learning some hardware.</p>\n<p>Dave Shea&#8217;s talk on Rolling Your Own CSS Methodology was not what I expected but I really enjoyed it. Dave created the classic site CSS Zen Garden and now heads a digital agency. He was discussing how he tried to take the best parts of CSS schools of thought (OOCSS, Atomic CSS, SMACSS, BEM) and create a system for his agency to use. To my surprise, he and I came to the exact same conclusions. We both came to the conclusion to use a BEM-like syntax and changed the modifiers so that they can be more efficiently used in multiples. It was kind of awesome to see that I had come to the same conclusion as him on my own. We chatted a bit afterwards and he seemed really awesome. In the next talk, which from from Mr. Doob, the creator of ThreeJS, some random guy sat down next to me and said &#8220;So did Dave offer you a job yet?&#8221; Haha, not yet!</p>\n<h3></h3>\n",
    "excerpt": "<p>Recap of day 3 of the conference in Toronto!</p>\n",
    "slug": "fitc-toronto-day-3"
  },
  {
    "date": "2015-04-21T00:02:57+00:00",
    "title": "FITC Toronto Day 2",
    "content": "<h2>FITC Toronto 2015</h2>\n<p>FITC is an annual design conference hosted in Toronto focused on merging the future, innovation, technology, and creativity! I was fortunate enough to win a free ticket for the second time when I entered the women&#8217;s initiative. I entered a site I designed and developed quickly for the contest.</p>\n<h3>Day 2 of the Conference</h3>\n<p>On day 2 we got there just in time for the first talk.</p>\n<h3>After the conference</h3>\n<p>The official event was an art battle, but our group decided that we weren&#8217;t really interested in that and headed off on our own.</p>\n<p>We talked to a lot of awesome people there, like Jason Pamental (author of responsive typography), Paul Trani (Adobe evangelist), Naomi Atkinson (all around awesome entrepreneur), and a bunch more cool people.</p>\n<p>Stay tuned for Day 3!</p>\n",
    "excerpt": "<p>FITC Toronto 2015 FITC is an annual design conference hosted in Toronto focused on merging the futur &#8230;</p>\n",
    "slug": "fitc-toronto-day-2"
  },
  {
    "date": "2015-04-20T20:37:17+00:00",
    "title": "HFOSS Final Proposal",
    "content": "<h2>Team Members</h2>\n<ul>\n<li>Josh Ladisic: jal5313@<span class=\"skimlinks-unlinked\">rit.edu</span></li>\n<li>Sarah Federman: sarah@<span class=\"skimlinks-unlinked\">mail.rit.edu</span></li>\n<li>Ryan Gannon: rmg8548@rit.edu</li>\n</ul>\n<h3>Project:</h3>\n<p>PathMan</p>\n<h3>Brief Description</h3>\n<p>The team will create a game which is designed to help fourth graders recognize patterns more quickly and easily.</p>\n<h3>Team Roles</h3>\n<p>(Tentative) Sarah will design and develop the front end of the program. Ryan will program the engine/back end. Josh will help with front end design, some back end programming, do user testing, and handle documentation.</p>\n<h3>Our Repository</h3>\n<p><a href=\"https://github.com/sarahbethfederman/PathMan\">https://github.com/sarahbethfederman/PathMan</a></p>\n<h3>Team Communication</h3>\n<p>Email, IRC, and Issue Tracker.</p>\n<h3>Easy Parts</h3>\n<ul>\n<li>Generating a grid of numbers</li>\n<li>Basic game functions (timer, move counter, etc)</li>\n<li>Basic front end design</li>\n</ul>\n<h3>Hard Parts</h3>\n<ul>\n<li>Checking for a guaranteed correct solution</li>\n<li>Ensuring the player doesn’t break any game rules</li>\n</ul>\n<h3>Plan</h3>\n<p>The team will use each other’s diverse knowledge to attempt to figure out any issues. If that fails, we can look to our upstream mentors. Milestones and issues will be tracked and completed via github.</p>\n",
    "excerpt": "<p>Team Members Josh Ladisic: jal5313@rit.edu Sarah Federman: sarah@mail.rit.edu Ryan Gannon: rmg854 &#8230;</p>\n",
    "slug": "hfoss-final-proposal-2"
  },
  {
    "date": "2015-04-20T00:28:39+00:00",
    "title": "FITC Toronto Day 1",
    "content": "<h2>FITC Toronto 2015</h2>\n<p>FITC is an annual design conference hosted in Toronto focused on merging the future, innovation, technology, and creativity! I was fortunate enough to win a free ticket for the second time when I entered the women&#8217;s initiative. I entered a site I designed and developed quickly for the contest.</p>\n<h3>Pre-Conference Trip</h3>\n<p>I carpooled with 3 friends from my major who were also going to the conference. We set up an AirBnB and decided to leave a day early. We left around 9 a.m. and went up to Niagara on the Lake, where Janette took us to some awesome wineries and we had lunch at a cute pub. I went from not liking wine, to buying an expensive ice wine sampler!</p>\n<p>We tried to find the mysterious chocolate factory a bartender at Inniskillin recommended, but it magically disappeared.</p>\n<h3>Day 1 of the Conference</h3>\n<p>We got to the conference bright and early at 9:30 a.m. for the 10 o&#8217;clock opening! I tried to enter the Adobe raffle for a free year of Creative Cloud but I was told Adobe interns weren&#8217;t eligible (Worth it! Imagination Lab @ Adobe, here I come!).</p>\n<p>The opening was a talk from Gavin Strange, who is just awesome. So passionate and so humble. I also went to his B-Side talk later during the conference. What an awesome guy! I</p>\n<h3>Opening Night Party</h3>\n<p>After the last talk of the day, we met up to go grab dinner. Janette (always the foodie) took us to an AMAZING authentic Japanese restaurant with a huge line and a crazy cool atmosphere. After that we headed over to the opening party at a Saloon. Country-themed in Canada, who would have guessed? <strong>Janette and I rode the mechanical bull.</strong> It was terrifying. I still think I won.</p>\n<p>We talked to a lot of awesome people there, like Jason Pamental (author of responsive typography), Paul Trani (Adobe evangelist), Naomi Atkinson (all around awesome entrepreneur), and a bunch more cool people.</p>\n<p>Stay tuned for Day 2!</p>\n",
    "excerpt": "<p>FITC Toronto 2015 FITC is an annual design conference hosted in Toronto focused on merging the futur &#8230;</p>\n",
    "slug": "fitc-toronto-day-1"
  },
  {
    "date": "2015-03-31T03:38:11+00:00",
    "title": "Girl Develop It WordPress Workshop",
    "content": "<p>Girl Develop It is a non-profit organization that helps women aged 18+ learn to code. I&#8217;ve been working with them to TA and am going to start teaching classes soon as well.</p>\n<p>This past week I was a teaching assistant for the WordPress 2-part Workshop. I basically helped out with hands-on stuff and added my input on topics during the lecturing.</p>\n<p>One student asked to hire me to set up her WordPress site on her GoDaddy account, and I was happy that I could tell her that by the end of the class she would be able to do it herself! I had her stay after class and we spent around 10 minutes getting it up and running. She was really happy that it was so easy and I was glad that coming out of the class she was able to it herself without a lot of trouble instead of hiring someone else to do it.</p>\n<p>All of the curriculum is open source and available on Github here: <a href=\"https://github.com/girldevelopit\">https://github.com/girldevelopit</a></p>\n",
    "excerpt": "<p>Girl Develop It is a non-profit organization that helps women aged 18+ learn to code. I&#8217;ve bee &#8230;</p>\n",
    "slug": "tales-from-the-gdi-wordpress-workshop-ta"
  },
  {
    "date": "2015-03-17T06:13:07+00:00",
    "title": "EDU Curriculum Assignment",
    "content": "<p>Common Core is a curriculum plan used by several states like MA and NY to govern the material taught in schools. For my HFOSS class, our final project is to make an educational game for OLPCs that tackles some of the learning objectives from Common Core.</p>\n<p><em>Which units were interesting to me: </em><strong></strong></p>\n<ul>\n<li>Geometry, Pattern recognition, Operations in Base 10<strong> </strong></li>\n</ul>\n<p><em>Which units were not interesting to me:</em></p>\n<ul>\n<li>Fractions, Grammar, and the science sections</li>\n</ul>\n<p><i>3 possible game mechanics:</i></p>\n<ul>\n<li>Given a number, show it in base 10 form</li>\n<li>Pick the appropriate tool of measurement for an object (ie grams for paperclips, kg for elephants)</li>\n<li>Given a patter, pick the next object</li>\n</ul>\n",
    "excerpt": "<p>Common Core is a curriculum plan used by several states like MA and NY to govern the material taught &#8230;</p>\n",
    "slug": "edu-curriculum-assignment"
  },
  {
    "date": "2015-03-16T18:38:27+00:00",
    "title": "HFOSS Commarch Project (Socket.io)",
    "content": "<p>Humanitarian Open Source Software<br />\nFall 2013 – Professor decause<br />\nOriginal Design Professor David Shein</p>\n<p>“Commarch” &#8212; Community Architecture</p>\n<p>Open Source Community Characterization Assignment</p>\n<p>Working in groups of two or three (formed during class), you are going to look<br />\nat FOSS community/project and deduce how that community is organized. You may<br />\nalso use some of these techniques to assess pre-existing FOSS projects you wish<br />\nto contribute to for your term project (highly recommended!)</p>\n<p>0.  Choose your team. We&#8217;ll be doing this in class, and teams must be approved<br />\n    by your instructor.</p>\n<p>1.  Choose a FOSS Project. You can use Ohloh.net and OpenHatch.org collect<br />\n    general information on Free/Open Source projects (including games!). Select<br />\n    one active software project about which to write. Have an alternative handy<br />\n    if you find that you cannot get much information about your first choice.<br />\n    Project choices must be approved by your instructor.</p>\n<p>2.  Follow the instructions included in the &#8220;Git By A Bus&#8221; repository on Github<br />\n    to generate a report on your selected project, available here:<br />\n    https://github.com/tomheon/git_by_a_bus</p>\n<p>3.  Calculate your project&#8217;s &#8220;Callaway Coefficient of Fail&#8221; using the rubric available here:<br />\n    http://hfoss-fossrit.rhcloud.com/static/books/tomspotcallaway-howtotellifyourfossprojectisdoomedtofail.pdf</p>\n<p>4.  Dig deeper. Provide answers to the following questions:</p>\n<p>    If applicable, list or provide links to:<br />\n        I.      The project&#8217;s IRC Channel<br />\n        II      Source Code repository<br />\n        III.    Mail list archive<br />\n        IV.     Documentation<br />\n        V.      Other communication channels<br />\n        VI.     Project Website and/or Blog</p>\n<p>    A.  Describe software project, its purpose and goals.</p>\n<p>\t&#8220;Socket.IO enables real-time bidirectional event-based communication. It&#8217;s a nodeJS framework that uses websockets.&#8221;</p>\n<p>    B.  Give brief history of the project. When was the Initial Commit? The<br />\n        latest commit?</p>\n<p>\tThe initial commit was: May 1, 2011<br />\n\tThe most recent commit was: 23 Days ago</p>\n<p>    C.  Who approves patches? How many people?</p>\n<p>\tLead developer &#8220;rauchg&#8221; approves patches. He seems to be the only one.</p>\n<p>    D.  Who has commit access, or has had patches accepted?  How many<br />\n        total?</p>\n<p>\tThe project has 86 contributors who have had patches accepted. Those contributors have had 1,391 commits.<br />\n  Source: https://www.openhub.net/p/socketio</p>\n<p>    E.  Who has the highest amounts of &#8220;Unique Knowledge?&#8221; (As per your<br />\n        &#8220;Git-by-a-bus&#8221; report. If there is a tie, list each contributor, with<br />\n        links if possible)</p>\n<p>\tAccording to the report created by Git By A Bus, Guillermo Rauch (rauchg) has the highest amount of unique knowledge (by a significant margin)</p>\n<p>    F.  What is your project&#8217;s &#8220;Calloway Coefficient of Fail?&#8221;</p>\n<p>\t15pts, lack of email list</p>\n<p>    G.  Has there been any turnover in the Core Team? (i.e. has the same<br />\n        top 20% of contributors stayed the same over time? If not, how has<br />\n        it changed?)</p>\n<p>\tContributor &#8220;rauchg&#8221; has had the most commits and has been working on the project since the start. The other top contributors no longer seem to contribute to the project. Beyond the top six contributors, everyone has contributed less than ten commits.</p>\n<p>    H.  Does the project have a BDFL, or Lead Developer? (BDFL ==<br />\n        Benevolent Dictator for Life)</p>\n<p>\tOne lead developer, &#8220;rauchg&#8221; seems to do the majority of the development. They have authored 741 commits of the 1,391. Over half.</p>\n<p>    I.  Are the front and back end developers the same people? What is the<br />\n        proportion of each?</p>\n<p>\tThe front and back end developers are the same people. There is no GUI so the front end development is minimal.</p>\n<p>    J.  What have been some of the major bugs/problems/issues that<br />\n        arisen during development? Who is responsible for quality control<br />\n        and bug repair?</p>\n<p>\tThe biggest issue people have seems to be with unexpected disconnects. This issue is normally caused by the user, and they typically figure out how to fix it. The vast majority of issues reported are solved by the reporter and don&#8217;t seem to be the fault of socket.io itself. There don&#8217;t seem to have been many issues that were serious blockers. Most actual bugs in the past have been related to connection/disconnection issues on one specific platform.</p>\n<p>    K.  How is the project&#8217;s participation trending and why?</p>\n<p>\tThe project&#8217;s participation has varied highly over time. Over the last year it has been more steady, and that trend seems to continue into 2015.</p>\n<p>    L.  In your opinion, does the project pass &#8220;The Raptor Test?&#8221;<br />\n        (i.e. Would the project survive if the BDFL, or most active<br />\n        contributor were eaten by a Velociraptor?) Why or why not?</p>\n<p>\tNo. The lead developer seems to have a lot of unique knowledge, and seems to do the vast majority of the actual writing.</p>\n<p>    M.  In your opinion, would the project survive if the core team, or<br />\n        most active 20% of contributors, were hit by a bus? Why or why not?</p>\n<p>\tNo. Beyond the top six contributors most people have contributed relatively little work.</p>\n<p>    N.  Does the project have an official &#8220;on-boarding&#8221; process in place?<br />\n        (new contributor guides, quickstarts, communication leads who focus<br />\n        specifically on newbies, etc&#8230;)</p>\n<p>\tNo official on-boarding process, but they do actively direct people to their Slack channel.</p>\n<p>    O.  Does the project have Documentation available? Is it extensive?<br />\n        Does it include code examples?</p>\n<p>\tThe project has documentation on how to implement it from the users&#8217; standpoint. There doesn&#8217;t seem to be information on on-boarding new developers.</p>\n<p>    P.  If you were going to contribute to this project, but ran into<br />\n        trouble or hit blockers, who would you contact, and how?</p>\n<p>\tThey have an active Slack channel. That is where they direct people with questions.</p>\n<p>    Q.  Based on these answers, how would you describe the decision making<br />\n        structure/process of this group?  Is it hierarchical, consensus<br />\n        building, ruled by a small group, barely contained chaos, or ruled<br />\n        by a single or pair of individuals?</p>\n<p>\tThe lead developer seems to make all of the final decisions. However, there are some people who help him review and test patches.</p>\n<p>    R.  Is this the kind of structure you would enjoy working in? Why, or<br />\n        why not?</p>\n<p>\tIn this case, it seems like a fine system. The lead developer is active and quick to respond. He seems to make well informed choices for the good of the project. Most people would probably be fine working in this system.</p>\n<p>5.  Write up a set of answers to these questions including how you arrived at<br />\n    your conclusions (links, convo quotes, irc logs, email threads, etc.) to be<br />\n    posted to your blogs individually. Each member can link to the same<br />\n    analysis, but should give a personal account &#8220;in your own voice.&#8221;</p>\n<p>6.  Prepare in a brief slide-deck to present as a group to the class based on<br />\n    your research.</p>\n",
    "excerpt": "<p>Humanitarian Open Source Software Fall 2013 – Professor decause Original Design Professor David Sh &#8230;</p>\n",
    "slug": "hfoss-commarch-project-socket-io"
  },
  {
    "date": "2015-03-11T21:21:27+00:00",
    "title": "Sass, BEM, and Semantics",
    "content": "<p><strong>This is a repost of an article I wrote originally posted on the Lookthink blog <a href=\"http://blog.lookthink.com/bem-sass-and-semantics/\">here</a>.</strong></p>\n<p><em>Today’s post is brought you by our fantastic summer intern, Sarah Federman. Sarah is a New Media Design major at the Rochester Institute of Technology and has brought her A-game to our Development team. From spearheading website builds to supporting the design team, Sarah has played a major role in the projects flowing through our office this summer. Follow @sarah_federman on Twitter for the latest and greatest in bleeding edge techniques for front end development!</em></p>\n<p>There’s a nice buzz around the topics of modular CSS and CSS Preprocessors these days, but do they go hand in hand?</p>\n<p>If you haven’t heard of it, BEM stands for Block-Element-Modifier, and is a syntax system and philosophy for creating flexible css modules. You can read more about it here: http://csswizardry.com/2013/01/mindbemding-getting-your-head-round-bem-syntax/</p>\n<p>I recently started working on a news site that displays articles in several distinct ways. Thus, the easiest and most reusable abstraction was to create a module for displaying article information.</p>\n<p>My blocks included things like:</p>\n<pre>.article__title\r\n .article__date\r\n .article__description</pre>\n<p>One modifier is for displaying articles in a tile-like grid format</p>\n<pre>.article—tile</pre>\n<p>…but they’re also styled differently in the footer:</p>\n<pre>.article—tile—footer</pre>\n<p>Add in more modifiers for promoted “sticky” tiles, featured articles, articles that go within a media object, articles overlaying an image…and suddenly you’ve got a sizable module going.</p>\n<p>I started out going as Sass as possible, with something like this:</p>\n<pre>.article {\r\n &amp;__title {}</pre>\n<pre>&amp;__date {}</pre>\n<pre>&amp;__description {}</pre>\n<pre>&amp;—tile {\r\n &amp;__title {}</pre>\n<pre>&amp;__date {}</pre>\n<pre>&amp;—footer {\r\n &amp;__title {}</pre>\n<pre>&amp;__description {}\r\n } // end footer\r\n } // end tile</pre>\n<pre>&amp;—media {}\r\n } // end article</pre>\n<p>…And so on. And suddenly we’ve nested 6 levels down 350 lines. It might compile something pretty, but right now I’m looking through my own file and all I see are ampersands, and I’ve scrolled down and I can’t orient myself. Am I still looking at a tile? Am I back in the article root? Could someone else read this? Would this confuse my team members? Extending blocks closer to the root is suddenly complicated as well.</p>\n<p>It’s ugly and un-semantic. Is it theoretically well organized? Sure. Maybe I could have heavily commented, but I ended up taking out all of the ampersands and switching out of pure sass.</p>\n<pre>.article{}</pre>\n<pre>.article__title {}\r\n .article__date {}\r\n .article__description {}</pre>\n<pre>.article—tile {}</pre>\n<pre>.article—tile__title {}\r\n .article—tile__date {}</pre>\n<pre>.article—tile—footer {}</pre>\n<pre>.article—tile—footer__title {}\r\n .article—tile—footer__description {}</pre>\n<p>400 lines in, this is much more readable and easily maintainable. There are some places where I might consider making “article—“ a variable. This method certainly takes much more typing, but I think it’s worth it when it comes down to maintenance and semantics. Extending is also much easier. At-root is an option, but we still retain the same readability problems.</p>\n<p>Sass is still great for all sorts of functionality, like mixins and creating partials for your modules. I love Sass. But personally, I would caution against sacrificing semantics for quick typing.</p>\n<p>If I were to redo this, I might break it down further and start making more classes with less that I could use together in the HTML instead of extending the other blocks and rewriting rules.</p>\n",
    "excerpt": "<p>This is a repost of an article I wrote originally posted on the Lookthink blog here. Today’s post  &#8230;</p>\n",
    "slug": "sass-bem-and-semantics"
  },
  {
    "date": "2015-03-04T21:34:13+00:00",
    "title": "Commarch Team Proposal",
    "content": "<h2>Team Proposal</h2>\n<h3>List your other team members below</h3>\n<table border=\"1px\">\n<tr>\n<td>Josh Ladisic</td>\n<td>jal5313@rit.edu</td>\n</tr>\n<tr>\n<td>Ryan Gannon</td>\n<td>rmg8548@rit.edu</td>\n</tr>\n<tr>\n<td>Sarah Federman</td>\n<td>sarah@mail.rit.edu</td>\n</tr>\n</table>\n<h3>Which project did your team choose?</h3>\n<p><a href=\"http://socket.io\">Socket.io</a></p>\n<h3>2-liner description of the project?</h3>\n<p>Socket.IO is node.js framework that enables real-time bidirectional event-based communication.</p>\n<p>It works on every platform, browser or device, focusing equally on reliability and speed.</p>\n<h3>What will each team member&#8217;s role be?</h3>\n<p>(Tentative) Sarah will function as Project Manager, Josh will be in charge of our Github repo (approve merges, etc), and Ryan will be in charge of communicating with project contributors.<br />\n  These roles will all overlap.</p>\n<h3>Source Code Repository URL?</h3>\n<p><a target=\"_blank\" href=\"https://github.com/Automattic/socket.io\">https://github.com/Automattic/socket.io</a></p>\n<h3>List your upstream Mentor&#8217;s below:</h3>\n<p><em>We&#8217;re still working on this part!</em></p>\n<table border=\"1px\">\n<tr>\n<td>Name</td>\n<td>email</td>\n</tr>\n<tr>\n<td>One</td>\n<td>One</td>\n</tr>\n<tr>\n<td>Two</td>\n<td>Two</td>\n</tr>\n<tr>\n<td>Three</td>\n<td>Three</td>\n</tr>\n<tr>\n<td>Four</td>\n<td>Four</td>\n</tr>\n</table>\n<h3>How will you communicate with them? (i.e. IRC Channel, Email Addresss, mail lists, issue trackers, etc&#8230;)</h3>\n<p>Slack server</p>\n<h3>What are the easy parts?</h3>\n<ul>\n<li>Sifting through documentation &#8211; it&#8217;s great</li>\n<li>Contacting and communicating with contributors &#8211; they have a Slack server</li>\n<li>Finding material on the library &#8211; they have a huge following.</li>\n</ul>\n<h3>What are the hard parts?</h3>\n<ul>\n<li>Finding out specific roles of contributors</li>\n<li>Team communication and workflow</li>\n<li>Understanding the code base</li>\n</ul>\n<h3>How will you overcome both?</h3>\n<ol>\n<li>Gather all the information we can from existing info on the blog, the website, and the Github repo</li>\n<li>Present ourselves to the Slack community and find specific liaisons</li>\n<li>Start a draft of the report</li>\n<li>Run the Git by a Bus report</li>\n<li>Finalize the report/blog post and fill in any missing info</li>\n</ol>\n",
    "excerpt": "<p>Team Proposal List your other team members below Josh Ladisic jal5313@rit.edu Ryan Gannon rmg8548@ri &#8230;</p>\n",
    "slug": "commarch-team-proposal"
  },
  {
    "date": "2015-03-04T04:25:34+00:00",
    "title": "Box &#8216;s &#8220;Troubleshooting at Scale&#8221; event",
    "content": "<p>This past Monday I left my HFOSS class early to go to a Box event on campus. It was listed on RIT&#8217;s job zone page as a &#8220;networking&#8221; event, but as I found out when I got there it was actually a presentation on troubleshooting at scale.</p>\n<p>Although it wasn&#8217;t really my part of the stack and I don&#8217;t have a lot of expertise, it was very interesting to see the kind of issues that a cloud based company faces at that kind of scale, and the processes they have to fix them. Box uses analytics tools like Splunk and test automation tools like ThousandEyes. I had actually heard of Splunk at Hack Upstate in Syracuse earlier this year when I worked with some of the engineers from the company on an Arduino project.</p>\n<p>Box has &#8220;on-call&#8221; engineers, who function as troubleshooters whenever an issue comes up even if it&#8217;s a 3am. While that doesn&#8217;t quite sound like an appealing job, I had never thought about having to deal with system issues where a few minutes of downtime directly translates into money lost. The internet can be a crazy place, and even if the loss of traffic isn&#8217;t Box&#8217;s fault (the example was an ISP&#8217;s failure), Box is still responsible for isolating the issue on their end and following up with whatever is hurting their traffic (Comcast, Verizon, etc.).</p>\n<p>So while it may not be directly applicable to my current stack environment, Box&#8217;s presentation still gave me a valuable perspective and I enjoyed the talk.</p>\n",
    "excerpt": "<p>This past Monday I left my HFOSS class early to go to a Box event on campus. It was listed on RIT&#038;#8 &#8230;</p>\n",
    "slug": "box-event"
  },
  {
    "date": "2015-02-25T22:23:58+00:00",
    "title": "2014 Internship Synopsis",
    "content": "<p><strong><em>This is a repost of a blog post published by Lookthink. <a href=\"http://blog.lookthink.com/2014-summer-synopsis-from-the-snarky-intern/\" target=\"_blank\">View the original</a></em></strong></p>\n<p><em>Friday marked the last day of Sarah’s summer internship with us and we were oh so sad to see her go! We were undoubtedly spoiled by her enthusiasm and willingness to take coding projects by the horns and we will certainly miss her can-do attitude. We wish her the best of luck in her remaining semesters at RIT. Check out her parting words below and follow her at @Sarah_federman.</em></p>\n<p>Dear Lookthink,</p>\n<p>Oh, hello! I guess it’s the end of the summer, isn’t it? I figured Lookthink deserved a shoutout for providing an amazing internship experience. Thanks, Lookthink! You rock! (Do I get a hoodie now?)</p>\n<p>Being a part of the Lookthink team is an experience in and of itself. I’ve never met another group of people that consistently beat me to the sarcastic one-liners. LT cultivates a productive, fun, witty, and creative culture in the office, which is imparted in everything we do. See how I said “we?” They’re super inclusive, too.</p>\n<p>But sadly, it’s time to get rid of the “we,” and go back to “they.” Here are some closing thoughts and things I’ve learned:</p>\n<p>1. Being the only intern in a small office, I had a lot of responsibility when working on projects. No coffee runs…unless Nate wanted his pink sugar. I learned a lot about time management and when to ask for help. Being self-taught with most of my programming, I’m used to turning to Google for answers and sifting through document after document. It took me a little while to realize I had an entire office full of knowledgable resources with valuable experience. It wasn’t “giving up,” it was asking for help. A team member with years of experience is infinitely more valuable than a vague stack overflow answer.</p>\n<p>2. In my interview, Joe asked me, “Do you think you have much more to learn about CSS?” And I came up with some answer about how CSS is constantly changing and needing to learn more and more as it evolves. And that’s true, but I really had no idea about how many little things I didn’t actually know about CSS. These things became wildly apparent to me as I took on bigger projects. I think I&#8217;ve come along way.</p>\n<p>I read something recently about learning web development. It said something like: “It’s very easy to start learning front-end web development. But it’s very difficult to get good at it.” This rings so true to me now. I may have a solid footing in the basics, but I have a ways to go. I’ve learned a lot working here, but I’ve realized the dangers of complacency. There is always something new to learn, even if it’s something as small as understanding how browsers process :nth-child selectors (Thanks for that one, <a href=\"http://lookthink.com/#/greg-bruening\">Greg</a>!).</p>\n<p>3. A long, long time ago, I did a very small amount of freelance. I did whatever the clients asked, because they were the ones paying. But from watching <a href=\"http://lookthink.com/#/molly-nizhnikov\">Molly</a> and <a href=\"http://lookthink.com/#/rachael-mahr\">Rachael</a>, I’ve learned that part of what clients are paying for is your expertise. The best clients are the ones that realize this and work with us to compromise. Blindly doing whatever a client asks is almost dishonest. You have a responsibility to work with them to create a better solution. Again, it’s a balance. The best work involves plenty of compromises.</p>\n<p>4. Learning on the job is really amazing experience. I had never touched PHP or WordPress before this summer, and I had never put what I knew about sass and sass frameworks into practice. It’s super rewarding to hit an obstacle, overcome it (with help, sometimes), and see the results in a tangible finished project.</p>\n<p>This is getting too long. But there’s plenty more, I promise. Side notes:</p>\n<p>Random things I will definitely miss about Lookthink:<br />\n&#8211; The weekly meeting intro questions. You guys have such…interesting…answers.<br />\n&#8211; Bethany’s swearing. At everything.<br />\n&#8211; Joe’s check-ins (especially over lunch)<br />\n&#8211; Molly and Rachael squealing about cute baby things.<br />\n&#8211; That one time the massage therapist started talking about rainbows. Or something.<br />\n&#8211; Trying to get answers from Greg. Out-snarked every time.<br />\n&#8211; Nate’s tacos. Yas.<br />\n&#8211; Dropping absolutely everything to watch the The World Cup.<br />\n&#8211; Erik talking about the World Cup.<br />\n&#8211; Randomly running into Chris on the commute. Chris realizing that I’m next to him, 5 minutes later.<br />\n&#8211; Jihye’s shouting at the top of her lungs. Every day. (…not really.)<br />\n&#8211; Goodshuffle jokes.<br />\n&#8211; Vim jokes.<br />\n&#8211; Working on three screens. How will I ever go back?!<br />\n&#8211; Hip Hop Fridays.</p>\n<p>…etc. etc. etc.</p>\n<p>Aaaand things I won’t miss:<br />\n&#8211; Fireworks.<br />\n&#8211; IE8 Compatibility.<br />\n&#8211; Temporarily Broken A/C.<br />\n&#8211; Missing ALL the movie references because I’m a baby.</p>\n<p>…That is all.</p>\n<p>So I just wanted to say thanks again for a great summer. I learned lots. I will try my hardest to take it with me wherever I end up next.</p>\n<p>Sincerely,<br />\nSarah Federman</p>\n<p>P.S. Do I get a hoodie now?</p>\n<p>UPDATE: I totally got my hoodie on my last day!!</p>\n",
    "excerpt": "<p>Summary of my summer internship experience and what I learned while at Lookthink</p>\n",
    "slug": "2014-summer-internship-synopsis"
  },
  {
    "date": "2015-02-25T18:39:15+00:00",
    "title": "XO Box &#8220;Smoke test&#8221;",
    "content": "<p>For my HFOSS course, we were given XO boxes so we can start developing open source projects for the platform! For our &#8220;smoke test&#8221;, we followed the directions here: http://wiki.laptop.org/go/Smoke_test/10.1.x/1_hour_smoke_test</p>\n<p>&nbsp;</p>\n",
    "slug": "xo-box-smoke-test"
  },
  {
    "date": "2015-02-23T19:25:58+00:00",
    "title": "HFOSS Bugfix Assignment",
    "content": "<p>One of my assignments for HFOSS was to submit a bugfix for an open source project. Fancybox is one of the most popular jQuery lightbox plugins, and while I was beginning to integrate it into my portfolio site, I noticed an issue. On the plugin&#8217;s documentation website, two of the flickr photos shown in the gallery were broken. While I couldn&#8217;t fix this myself because it wasn&#8217;t part of the plugin code, I was able to submit an issue and it was corrected very quickly.</p>\n<p><a href=\"https://github.com/fancyapps/fancyBox/issues/1009\">https://github.com/fancyapps/fancyBox/issues/1009</a></p>\n",
    "excerpt": "<p>One of my assignments for HFOSS was to submit a bugfix for an open source project. Fancybox is one o &#8230;</p>\n",
    "slug": "hfoss-bugfix-assignment"
  },
  {
    "date": "2015-02-23T19:07:50+00:00",
    "title": "My WIC Hacks 2015 experience",
    "content": "<p>So this weekend I participated to WIC hacks 2015, which is an all-women hackathon sponsored by RIT&#8217;s Women In Computing group! I worked on a team of 3 doing design and front-end development with two second year computer science majors, Susan Lunn and Madison Flaherty. They&#8217;re badasses, so they decided to write our backend in Haskell.</p>\n<p>Our app was a responsive web application meant to help women find verified clinics near them. Public hospitals and Planned Parenthoods were key. Many &#8220;clinics&#8221; do not have certified medical professionals onsite and women do not get the treatment and medical information they need.</p>\n<p>We took a mobile-first approach and I designed and coded a simple interface in sass with Bourbon. I used the Geolocation API to grab user&#8217;s coordinates on the homepage and pass that to a search results page that is templated via Handlebars.js from a JSON value. The JSON value is returned from our Haskell backend which hits the Google Maps API to grab results of clinics.</p>\n<p>&nbsp;</p>\n",
    "excerpt": "<p>So this weekend I participated to WIC hacks 2015, which is an all-women hackathon sponsored by RIT&#038; &#8230;</p>\n",
    "slug": "my-wic-hacks-2015-experience"
  },
  {
    "date": "2015-02-11T17:33:56+00:00",
    "title": "The Open Source Way &#8211; Quiz",
    "content": "<p>For my Humanitarian Free and Open Source Software development class, we were given a quiz about comparing the principles of open source presented in Weber&#8217;s <em>The Success of Open Source</em>, and the five pillars of &#8220;The Open Source Way.&#8221; Our submission was via blog format so here goes:</p>\n<ol>\n<li>What are the titles of each General principle?\n<ol>\n<li>Make it interesting and make sure it happens</li>\n<li>Scratch an itch &#8211; solve a real problem</li>\n<li>Minimize how many times you have to reinvent the wheel</li>\n<li>Solve problems through parallel work processes whenever possible.</li>\n<li>Leverage the law of large numbers &#8211; &#8220;Many eyes make any bug shallow&#8221;</li>\n<li>Document what you do</li>\n<li>Release early and release often</li>\n<li>Talk a lot</li>\n</ol>\n</li>\n<li>What are the titles of each Pillar?\n<ol>\n<li>Open exchange</li>\n<li>Participation</li>\n<li>Rapid prototyping</li>\n<li>Meritocracy</li>\n<li>Community</li>\n</ol>\n</li>\n<li>What are the similarities between Weber&#8217;s eight principles, and the five pillars?\n<ul>\n<li>Both documents place a ton of emphasis on how the community interacts and believe that the key to successful open source projects is making everything open and accessible.</li>\n</ul>\n</li>\n<li>What are the differences?\n<ul>\n<li>Weber tends to focus on the effect and actions of individuals, whereas the Five Pillars tend to effect the community as a whole, and use words like &#8220;we&#8221; more often.</li>\n</ul>\n</li>\n<li><span class=\"label label-info\">Bonus:</span> Who&#8217;s &#8220;keen analysis&#8221; did Weber &#8220;Draw Heavily&#8221; upon?&#8221;\n<ul>\n<li>Eric S. Raymond</li>\n</ul>\n</li>\n<li><span class=\"label label-success\">Double-Bonus:</span> What was the title of this &#8220;keen analysis.&#8221; (Hint: Weber hinted at the title when he was talking about Cathedrals earlier in the chapter.)\n<ul>\n<li>The Cathedral and the Bazaar</li>\n</ul>\n</li>\n<li><span class=\"label label-warning\">Triple-Bonus:</span> Where can this keen analysis be found? (Answer in URL form, i.e. <code>http://placeofkeenanalysisis.com/analysis</code>)\n<ul>\n<li><a href=\"http://www.catb.org/esr/writings/cathedral-bazaar/cathedral-bazaar/\">http://www.catb.org/esr/writings/cathedral-bazaar/cathedral-bazaar/</a></li>\n</ul>\n</li>\n</ol>\n<div class=\"alert alert-info\"></div>\n",
    "excerpt": "<p>Quiz on Open Source Literary Assignment from HFOSS course</p>\n",
    "slug": "the-success-of-open-source-the-open-source-way-quiz"
  },
  {
    "date": "2015-02-09T12:42:40+00:00",
    "title": "&#8220;What is Open Source and How Does it Work?&#8221;",
    "content": "<h2>Chapter 3 Literature Review</h2>\n<p>HFOSS is not a literature course, but as a member of the FOSS community, there are many texts to grok to help you down the path. Our professor Remy has provided some texts, and many more were contributed by other Professors, hackers, and community members who thought these works were important enough to share with graduating college students about to enter the &#8220;real-world.&#8221; Here is the first lit review for the semester!</p>\n<p><strong><em>Author:</em> </strong>Steve Weber</p>\n<p><strong><em>Title:</em> </strong>&#8220;What is Open Source and How Does it Work?&#8221; &#8211; Chapter 3</p>\n<p><strong><em>Location:</em></strong> <a href=\"http://hfoss-ritigm.rhcloud.com/static/books/Weber-SuccessofOpenSource-Chap3.pdf\">http://hfoss-ritigm.rhcloud.com/static/books/Weber-SuccessofOpenSource-Chap3.pdf</a></p>\n<p><em><strong>Publish Date:</strong> </em>2004</p>\n<p><strong><em>The Gist:</em></strong></p>\n<p>This chapter discusses problems in software development and how open source development can help overcome them.</p>\n<p><strong><em>The Good:</em></strong></p>\n<ol>\n<li>Reading about the creation of Linux was super interesting.</li>\n<li>It was a very logical and structured intro into Open Source, something which I&#8217;ve wanted for a while now.</li>\n<li>It wasn&#8217;t very technical and someone like me who doesn&#8217;t really have a software development background could still follow.</li>\n</ol>\n<p><strong><em>The Bad:</em></strong></p>\n<ol>\n<li>Academic writing is purple. There does not need to be that many words or syllables. How about some brevity?</li>\n<li>Nice graphs! They made the information a bit more accessible.</li>\n<li>Couldn&#8217;t read the footnotes, which, again, usually makes information easier to understand.</li>\n</ol>\n<p><strong><em>Questions:</em></strong></p>\n<ol>\n<li>The concerns about forking with less-than-positive intentions were interesting but muddy. Where are the lines and how do we establish common law and social rules around this? What are they? Or is there a committee for this somewhere?</li>\n<li>Is open source always the solution? I&#8217;d like to know more about when it wouldn&#8217;t make sense for a project.</li>\n<li>I would like to know more about how open source projects are sustained over time and how they have impacted other projects today.</li>\n</ol>\n<p><strong><em>My Review:</em></strong></p>\n<p>This was a suitable intro to the philosophy of Open Source and why we do what we do, which is something I&#8217;ve been hoping to read for a while. It was really purple, but still got the job done. I wish it had take a bit more of a solid stance on some issues, as I&#8217;m still too much of a newbie to really draw my own conclusions about some of these issues, but I suppose that will come with time.</p>\n",
    "excerpt": "<p>Literary Review Assignment 1 from HFOSS class</p>\n",
    "slug": "lit-review-1"
  },
  {
    "date": "2015-02-08T08:12:17+00:00",
    "title": "HFOSS First Flight",
    "content": "<p>This semester I&#8217;m taking Humanitarian Free and Open Source Software for my general education elective. Part of the course requires a weekly blog, and our first assignment was the setting up of said blog. <a href=\"http://hfoss-ritigm.rhcloud.com/hw/firstflight\" target=\"_blank\">http://hfoss-ritigm.rhcloud.com/hw/firstflight</a></p>\n<p>I installed WordPress on my website, it&#8217;s been a bit of a kick in the butt to get started on my portfolio.</p>\n<p>We had to create a YAML file with our information included, and then create a pull request to have the file added to the class repository on Github.</p>\n<p>I&#8217;m looking forward to the rest of the class!</p>\n",
    "excerpt": "<p>First assignment for HFOSS class and its process</p>\n",
    "slug": "hfoss-first-flight"
  }
]