[
  {
    "title": "Chadder",
    "subtitle": "Website Reboot",
    "description": "I designed and developed a new responsive website for RIT-based startup Chadder",
    "slug": "chadder",
    "backgroundImage": "mockups/chadder1.jpg",
    "logo": "chadder/logo.svg",
    "order": 0,
    "next": "particle",
    "prev": "ntlb",
    "tags": [
      "Time: 3 weeks",
      "UI/UX design",
      "Concept/Strategy",
      "HTML5",
      "jQuery",
      "SCSS"
    ],
    "content": {
      "description": "<p>Chadder is an RIT-based startup. They created an end-to-end encrypted private messaging mobile application. In need of a site redesign, they approached me with the project.I designed the website for my GUI course project and continued on to develop the site on my own, until I helped officially launch the app at CES 2015 in Las Vegas. Utilizing a responsive approach, the site's main function is to increase app downloads. Currently featured on <a class=\"red\"  href=\"http://www.producthunt.com/posts/chadder\" target=\"_blank\">Product Hunt</a>!</p>",
      "finalThoughts": "<p>This was such a rewarding project! I learned about startups, got to pitch users and press in Vegas at CES, and got to do the design and development of the whole project.</p><p>If I could go back, I would implement a different image for the final slide and it seems to stock image-y.</p>",
      "slides": [
        {
          "colorScheme": "dark",
          "title": "Design Process",
          "subtitle": "Initial Iteration",
          "content": "<p class=\"band\">Upon reflection, I decided that I wasn't invoking the emotional response necessary for a security-focused application. With some copy changes and some bolder colors and imagery, I came to a final solution.</p><div class=\"image-container\"><a href=\"https://s3.amazonaws.com/sarahfederman-portfolio/chadder/mockup2.jpg\" rel=\"chadder\" class=\"lightbox\"><img class=\"half\" src=\"https://s3.amazonaws.com/sarahfederman-portfolio/chadder/mockup2.jpg\" alt=\"final design\" /></a><a href=\"https://s3.amazonaws.com/sarahfederman-portfolio/chadder/overlay.jpg\" rel=\"chadder\" class=\"lightbox\"><img class=\"half\" src=\"https://s3.amazonaws.com/sarahfederman-portfolio/chadder/overlay.jpg\" alt=\"overlay\" /></a></div>"
        },
        {
          "colorScheme": "light",
          "title": "Development Cycle",
          "subtitle": "Front-end Development",
          "content": "<p class=\"band\">This was a bit of a sprint, since we only had about a week to prepare in between final exams and leaving for CES.Because of this, I had to nix some of the extra effects I'd intended, like parallax scrolling.</p>",
          "timeline": [
            {
              "image": "chadder/comp-match.jpg",
              "title": "Comp Matching",
              "description": "I used Adobe Extract to quickly get critical information about colors, dimensions, etc."
            },
            {
              "image": "chadder/comp-small.jpg",
              "title": "PX to REMs",
              "description": "All pixel values were converted to rems by use of a sass function, from the Bourbon sass framework"
            },
            {
              "image": "chadder/overlay-small.jpg",
              "title": "Modals",
              "description": "With the help of CSS animations and some jQuery, I created custom modals for non-critical information"
            },
            {
              "image": "chadder/mobile.jpg",
              "title": "Mobile Responsive",
              "description": "With the help of some media query adjustments, the mobile version came to life"
            }
          ]
        }
      ]
    },
    "liveSite": "http://chadder.im",
    "repo": "https://github.com/sarahbethfederman/Chadder-Redesign"
  },
  {
    "title": "Interactive Particle Playground",
    "subtitle": "HTML5 Canvas Experiment",
    "description": "I developed a musical particle experience using HTML5 canvas and the web audio API",
    "slug": "particle",
    "backgroundImage": "mockups/particle3.jpg",
    "order": 1,
    "next": "spruce-health",
    "prev": "chadder",
    "tags": [
      "Time: 3 weeks",
      "UI/UX design",
      "Object-oriented JS",
      "HTML5 Canvas",
      "Web Audio API"
    ],
    "content": {
      "backgroundImage": "mockups/particle.png",
      "description": "<p>For my Rich Media Web Application Development I class, our first project was a HTML5 canvas project. I chose to create a experimental experience using particle systems and the web audio API. This was a chance for me to get into the nitty gritty of object-oriented javascript and prototypal inheritance.</p>",
      "finalThoughts": "<p>I learned so much from this project! This was the first pure js-driven application I've written. I learned a lot about Canvas, vanilla javascript, AMD, and designing an application structure.</p><p>The interface is lacking, however, though functional. I may try to provide a nicer UI when I have some extra time. I'd also like to include a beat detection library and do more with the Web Audio API.</p>",
      "slides": [
        {
          "colorScheme": "dark",
          "title": "Concept",
          "content": "<p class=\"band\">Create a galaxy of particles that react to field effectors, and the frequency of an audio sample. Allow the user to interact with the environment and experiment on their own.</p>"
        },
        {
          "colorScheme": "light",
          "title": "Development Cycle",
          "subtitle": "Javascript Development",
          "content": "<p class=\"band\">There's a lot more I wish I could have done with the user experience, but I learned a ton about the technology involved in the project and it was a really great exercise in rapid learning.</p>",
          "timeline": [
            {
              "image": "particle/require.png",
              "title": "RequireJS",
              "description": "I used requireJS for module dependency management, which was my first experience with AMD"
            },
            {
              "image": "particle/js.png",
              "title": "Object-Oriented Javascript",
              "description": "The program is structured in pieces, some of which follow the Singleton pattern, others the Module pattern"
            },
            {
              "image": "particle/audio.jpg",
              "title": "Web Audio API",
              "description": "The attraction of the fields is dependent on the average frequency of the music"
            },
            {
              "image": "particle/particle.jpg",
              "title": "Interactive Elements",
              "description": "Users can create new Fields and Emitters to adjust the output of the particles"
            }
          ]
        }
      ]
    },
    "liveSite": "https://s3-us-west-1.amazonaws.com/js-particle/index.html",
    "repo": "https://github.com/sarahbethfederman/interactive-particle-system"
  },
  {
    "title": "Spruce Health",
    "subtitle": "Blog Reboot",
    "description": "I developed a custom responsive Wordpress theme for Google Venture-backed startup Spruce Health",
    "slug": "spruce-health",
    "backgroundImage": "mockups/spruce.jpg",
    "logo": "spruce/logo.png",
    "order": 2,
    "next": "ntlb",
    "prev": "particle",
    "tags": [
      "Time: 34 hours",
      "Contract",
      "Wordpress",
      "Genesis",
      "PHP",
      "HTML5",
      "jQuery",
      "SCSS"
    ],
    "content": {
      "description": "<p>I developed a custom Wordpress theme for SF-based startup Spruce Health. They are KPCB and Google Ventures-baced and focus on telemedine and doctor/patient communication. I worked with their designer on getting a pixel perfect responsive experience for their readers.</p>",
      "finalThoughts": "<p>This was a really fun project and a great break from the complex web app development at scale I was doing at LinkedIn. It wasn't extremely technically challenging, but I think the experience is very polished and the client was really happy with it. Sometimes it's good to get back to your roots and get something on the page looking great!</p>",
      "slides": [
        {
          "colorScheme": "dark",
          "title": "Design Process",
          "subtitle": "Handoff",
          "content": "<p class=\"band\">I worked with Spruce Health's designer (and my former classmate!) Kaleigh, who sent me her mockups for mobile, tablet, and desktop. We chatted over the phone to clarify what I had questions about and continued via Slack whenever we needed to follow up.</p><div class=\"image-container\"><a href=\"https://s3.amazonaws.com/sarahfederman-portfolio/chadder/mockup2.jpg\" rel=\"chadder\" class=\"lightbox\"><img class=\"half\" src=\"https://s3.amazonaws.com/sarahfederman-portfolio/chadder/mockup2.jpg\" alt=\"final design\" /></a><a href=\"https://s3.amazonaws.com/sarahfederman-portfolio/chadder/overlay.jpg\" rel=\"chadder\" class=\"lightbox\"><img class=\"half\" src=\"https://s3.amazonaws.com/sarahfederman-portfolio/chadder/overlay.jpg\" alt=\"overlay\" /></a></div>"
        },
        {
          "colorScheme": "light",
          "title": "Development Cycle",
          "subtitle": "Front-end Development",
          "content": "<p class=\"band\">I used the Genesis framework as a starting point so I could iterate quickly</p>",
          "timeline": [
            {
              "image": "spruce/sketch.png",
              "title": "Comp Matching",
              "description": "I used the Sketch files to quickly get critical information about colors, dimensions, etc."
            },
            {
              "image": "chadder/comp-small.jpg",
              "title": "Desktop version",
              "description": "I started with the desktop version where I would normally start with mobile, because Genesis's starter css worked this way and it was cheaper to use that as a starting point"
            },
            {
              "image": "chadder/overlay-small.jpg",
              "title": "Custom Ad Post Type",
              "description": "I created a custom post type with 3 different template options using the Advanced Custom Fields plugin"
            },
           {
              "image": "spruce/mailchimp.png",
              "title": "MailChimp integration",
              "description": "I added inputs that connected to Spruce's MailChimp email subscriber list"
            },
            {
              "image": "chadder/mobile.jpg",
              "title": "Mobile and Table Responsive",
              "description": "With the help of some media query adjustments, the mobile and tablet versions came to life"
            }
          ]
        }
      ]
    },
    "liveSite": "http://blog.sprucehealth.com/",
    "repo": "https://bitbucket.org/sarahbethfederman/spruce-health"
  },
  {
    "title": "News to Live By",
    "subtitle": "Custom Wordpress Theme",
    "description": "I developed a responsive wordpress theme for a news website during my internship at Lookthink",
    "slug": "ntlb",
    "backgroundImage": "mockups/ntlb1.jpg",
    "order": 3,
    "next": "chadder",
    "prev": "spruce-health",
    "logo": "ntlb/logo.png",
    "tags": [
      "Role: Lead Developer",
      "HTML5",
      "CSS3",
      "Wordpress",
      "PHP",
      "MySQL"
    ],
    "content": {
      "description": "<p>In 2014, I interned at a small agency called Lookthink in Washington, DC. While I was there, I was asked to make a wordpress site for the first time. I first made a static site, and then converted it to a custom wordpress theme. This meant I had to pick up PHP. As the only intern on a small team, I picked up most of the development workload for this project, and was able to use the other devs as resources when I had questions.</p>",
      "finalThoughts": "<p>This was an awesome project because it really pushed me. I learned some PHP, learned some Wordpress, and had to utilize some of the command line MySQL I learned in my Database class.</p><p>If I could do it again, I would probably redesign the CSS architecture with more'abstract modules to get rid of some bloat. I would also try and do more traditional wordpress techniques, like taking advantage of 'the loop.'</p>",
      "slides": [
        {
          "colorScheme": "dark",
          "title": "Client",
          "subtitle": "News To Live By",
          "content": "<p class=\"band\">Our client was a high-traffic news blog with a primarily millenial audience. We had to meet their needs as modern on-the-go readers. We implemented a bolder responsive layout to make reading seamless from any device. A lot of emphasis was on social engagement because that was the driving force behind most traffic.</p>"
        },
        {
          "colorScheme": "light",
          "title": "Development Cycle",
          "subtitle": "Wordpress Development",
          "content": "<p class=\"band\">This was my first time writing a custom theme using Wordpress. While I was familiar with the CMS interface, I had never written any PHP or WP themes.</p>",
          "timeline": [
            {
              "image": "ntlb/comp.png",
              "title": "Comp Matching",
              "description": "I created a static site based off the comps handed to me by the designer"
            },
            {
              "image": "ntlb/ntlb-mobile.jpg",
              "title": "Mobile Responsive<",
              "description": "We utilized an off-canvas menu and reduced unnecessary content and clutter for the mobile and tablet versions."
            },
            {
              "image": "ntlb/wordpress.png",
              "title": "Wordpress Development",
              "description": "I started templating all of the dynamic content"
            },
            {
              "image": "ntlb/jetpack.png",
              "title": "Infinite Scrolling",
              "description": "We used Jetpack's infinite scroll plugin with some customization to enable the click to load more content feature."
            },
            {
              "image": "ntlb/database.jpg",
              "title": "Custom SQL Queries",
              "description": "For some pages, I had to utilize custom SQL queries to get specific content from the Wordpress database."
            },
            {
              "image": "ntlb/qa.jpg",
              "title": "QA Period",
              "description": "We used BrowserStack to do a lot of our QA, along with Edge Inspect, and tracked issues via Trello."
            }
          ]
        }
      ]
    },
    "liveSite": "http://newstoliveby.net"
  }
]
